window.addEventListener('load',function () {
    console.log('you see what?');
    mainEntrance()
})
/**
 * 今天13号了，该整理一下经济状况了，我记得20号要还款了，
 * 人体疲劳状态下，不行，需要睡觉休息，2022 0913 1252
 * 人生是什么？
 * 我也很迷茫，彷徨；
 * 我也不知道该做什么，真的很烦
 * 广州天气又热
 * 找工作还是要找的，
 * 精神状态不好
 * 先看一下经济状况：
 * 支付宝：额度 14200 已经借了 3000 剩余 11200 年利率13% 近期0922 要还270
 * 花呗 602 近期 0920
 * 租房日期 0902 第一个月房租 1002
*/
function mainEntrance(){
    /**
     * 事情虽然不好听，却是真实发生的，你是选择好看，还是选择真实？
     * 你觉得哪个更重要？
     * 先罗列一下cpu厂商，类型，
     * central processing unit 提取 解码 执行 写回
     * amd 超微 intel 英特尔 ARM 安谋 apple 苹果  ibm mtk 联发科 qualcomm 高通
     * 龙芯 中科院
     * 我认识里的常见的就这些，当然还有其他
     * 个人能做的事，汇编码，机器码，高级语言，
     * 这其中的转换过程 asm->mac 编译器 senior->asm 解释器
     * 建立通用的汇编，收集归纳吧，因为规则已经明确，但是具体的，每个厂商不一样，
     * 我的意思是，做一套工具出来，倒时候人们可以在不同的机器上拥有相同的代码，至少高级语言那一关，大家可以看懂
     * 
     * 那我应该先收集汇编码，简单汇编 模块汇编 条件汇编 宏汇编 高级汇编
     * 我可以先收集汇编码， 对他们进行归纳，通用的，特殊的，就是有些特定cpu型号才能使用的，
     * 加减乘除 运算 异或
     * 移位
     * 标志
     * 寄存器
     * 总线
     * 缓存
     * 
    */
   //模拟硬件 接收 需要拥有 被讨厌的勇气 不要内疚
}

/**
 * 制作二进制 执行
*/
function monitor(os_data){
    /**
     * 空间解析几何与向量几何
     * 多元函数的微分学
     * 重积分
     * 曲线积分与曲面积分
     * 常微分方程
     * 无穷级数
    */

    /**
     * 想起过往，我就，emo了，当然，
     * 寄存器有哪些？
     * 一条街有哪些铺面，有哪些商店？
     * 想着把MacBook air卖了换windows笔记本，有感觉太亏了，况且这个东西以后还是需要的
     * 如果要再买一个笔记本打游戏的话，就自己再去打工上班拿到的钱买一个，
     * 买个机械革命 万把块的， 如果我想说这个
    */

    /**
     * 
     * of course. 考研难 读研难吗？ 读研更难
     * 我问你一个问题？你能接受一个有过多个前任的对象吗？就是你能接受不是一手的吗？
     * 你可能会给自己找借口，给别人找借口说，那些东西可能是别人怎么不顺，不真诚，不怎么怎么样，
     * 大概意思就是，你现在对面这个人因为曾经各种不成熟，不怎么样，经历过了一些事变得更好了，
     * 但是你有没有想过一个问题，就是，他/她跟它以前那些对象都是真爱呢？都有着美好的经历呢，
     * 却因为一些不太合适的问题分开了，
     * 就是我想表达的是，就是他们以前的关系是美好幸福的，并没有发生你猜想中的那些不堪，
     * 你能接受吗？
     * 我们总是把人想的太完美，觉得别人分手了，是因为某些不好的因素，那假如没有不好的因素呢，就是腻了，烦了，
     * 这样你能接受吗？
     * 你是不是觉得有种一拳打在棉花的无奈感，
     * 你想象中的那种海誓山盟，至死不渝的爱情，并没有发生，只是淡淡的感觉，你如何自处？
    */

    /**
     * 有没有那么一款游戏能够解释生活中我所需要分析的事，而不是单纯的玩游戏，
     * 游戏作为生物的一种行为，我觉得他们不单单是娱乐那么简单，
     * 像动物的打闹，嬉戏，有利于练习捕猎技巧，
     * 我希望有一款游戏能改变我的生活，能辅助我的生活，进行决策，
     * 
     * 一个良好的行为习惯能对人有良好的改善，现在的情况是钱财有限，
     * 借钱来花，需要背负利息，也就是说，我可能一些不必要的花费，如：再买一台电脑来打游戏，
     * 虽然不贵3000多，但是如果这个钱需要追加利息，那就太亏了，
     * 假设这3000块不用来这个事，可以用来房租，吃饭上，那作用可大多了，
     * 
    */
}
/**
 *  比起真实的机器来说，我们课本上学到的只是比较理想化的模型，但是原理都是一套系统的，
 * 可以模拟出一些，
 * 并没有创造出足够的硬件来记录生活，
 * 如果过于详细反而会成为负担，丧失了最初的意义；
 * 洗澡吃饭， 刷牙 上厕所 散步，健康 牙龈出血 睡眠 
*/

/**
 * 2022 0915 thur 1421 现在有点热，需要洗一下，
 * 对 系统分层 处理 计算机组成原理 机器语言 汇编 高级语言
*/
